<template>
    <div class="app-page">
        <div class="row">
            <div class="col s12">
                <div class="page-title">Вопросы и ответы</div>
            </div>
        </div>
        <div class="row">
            <div class="col s12">
                <div class="card border-radius">
                    <div class="card-content setting-card">
                        <ul class="collapsible">
                            <li>
                                <div class="collapsible-header"><i class="material-icons">chevron_right</i>Создание Telegram Bot</div>
                                <div class="collapsible-body">
                                    <p>Делается это просто. В поиске Telegram наберите <b>@botfather</b>, откройте его и нажмите "Start":</p>
                                    <p>Далее:</p>
                                    <ul>
                                        <li>Выбираем команду <b>/newbot</b>, для создания нового бота.</li>
                                        <li>Вводим имя бота (название вашей компании на английском языке).</li>
                                        <li>Вводим ник бота, обязательно должно быть окончание bot (на английском языке).</li>
                                    </ul>
                                    <p>Если все прошло успешно, то вы увидите поздравление и токен вашего бота, который необходимо скопировать в настройки личного кабинета во вкладке Telegram.</p>
                                    <p>Для добавления описания о вашем боте и его аватара выбираем команду <b>/mybots</b> из списка выбираем ваш бот и нажимаем <b>Edit Bot</b>. <b>Edit Description</b> - отредактирует описание бота (этот текст будет отображаться при входе клиента в ваш бот) а <b>Edit Botpic</b> установит аватар для него.</p>
                                    <br>
                                    <h5>Подробная видеоинструкция по создания Telegram bot</h5>
                                    <video controls>
                                        <source src="video/telegram.mp4" type="video/mp4">
                                    </video>
                                </div>
                            </li>
                            <li>
                                <div class="collapsible-header"><i class="material-icons">chevron_right</i>Создание Viber Bot</div>
                                <div class="collapsible-body">
                                    <p>Для создания бота в Viber нужно перейти на сайт <a href="http://partners.viber.com/" target="_blank">partners.viber.com</a> В правом верхнем углу можно сразу выбрать русский язык. </p>
                                    <p>Далее из списка стран вам нужно выбрать вашу страну, ввести ваш номер телефона и нажать Войти. После этого на указаный номер телефона вы получите сообщение с кодом, который нужно ввести в следующем окне.</p>
                                    <p>Попадая в личный кабинет, в левой панели нажимаем кнопку Создать бот. Загружаем изображение для вашего бота (это изображение будет отображаться в профиле в viber).</p>
                                    <p>Далее заполняем все поля:
                                        <ul>
                                            <li>- <b>Account Name</b> - имя бота</li>
                                            <li>- <b>URI</b> - адрес бота, генерируется автоматически, но если будет предупреждение что такой адрес уже занят (подсветится красным) можно добавить знак '-' или любой другой символ</li>
                                            <li>- <b>Category</b> - категория вашего бизнеса (выбираем из списка)</li>
                                            <li>- <b>Subcategory</b> - подкатегория вашего бизнеса (выбираем из списка)</li>
                                            <li>- <b>Language</b> - язык (выбираем из списка)</li>
                                            <li>- <b>Description</b> - краткое описание о вашем боте (будет видно пользователю при подключении к боту)</li>
                                            <li>- <b>Website</b> - указываем ваш адрес сайта если есть, либо оставляем пустым</li>
                                            <li>- <b>Email Address</b> - ваша почта</li>
                                            <li>- <b>Location</b> - выбираем на карте ваше месторасположение</li>
                                        </ul>
                                    </p>
                                    <p>Отмечаем нижнюю галочку и нажимаем создать, после чего вам будет доступен токен вашего бота, который нужно скопировать в разделе Настройки личного кабинета.</p>
                                    <p>Для подключения бота в наш сервис, в раздел Настройки во вкладку Viber нужно добавить:
                                        <ul>
                                            <li>- <b>Viber token</b> - токен, который вы получили при создании бота</li>
                                            <li>- <b>Account Name</b> - имя бота, которое вы указывали при создании в поле Account Name</li>
                                            <li>- <b>Avatar</b> - изображение бота (будет отображаться при отправке сообщений), для вставки ссылки на изображение можно воспользоваться сервисом <a href="https://postimages.org/" target="_blank">postimages.org</a></li>
                                        </ul>
                                    </p>
                                    <br>
                                    <h5>Подробная видеоинструкция по создания Viber bot</h5>
                                    <video controls>
                                        <source src="video/viber.mp4" type="video/mp4">
                                    </video>
                                </div>
                            </li>
                            <li>
                                <div class="collapsible-header"><i class="material-icons">chevron_right</i>Как привлечь клиентов к ботам</div>
                                <div class="collapsible-body">
                                    <p>Для этого нужно поделиться пригласительной ссылкой на созданные боты с вашими клиентами. Ссылку можно разместить у себя на сайте и в социальных сетях.</p>
                                    <h5>Ссылка на бот в Telegram:</h5>
                                    <p>Во время создания бота в мессенджере Telegram вы получили такое сообщение с токеном и пригласительной ссылкой:</p>
                                    <p><img src="https://i.postimg.cc/rmBBRc7Q/photo-2020-08-25-19-06-14.jpg" alt=""></p>
                                    <h5>Ссылка на бот в Viber:</h5>
                                    <p>Чтобы получить пригласительную ссылку для Viber бота, вставьте в поле URI вашего бота (вы получили его при создании, а также его можно посмотреть по адресу <a href="http://partners.viber.com/" target="_blank">partners.viber.com</a>) и нажмите Получить ссылку</p>
                                    <hr>
                                    <div class="viber-link-box">
                                        <div class="row">
                                            <div class="input-field col s6">
                                                <input placeholder="Введите URI Бота" type="text" v-model="botName">
                                            </div>
                                            <div class="input-field col s6">
                                              <input v-model="link" type="text" class="validate" readonly>
                                            </div>
                                            <div class="col s12">
                                              <button class="waves-effect waves-light btn accent left" @click.prevent="makeViberLink">Получить ссылку</button>
                                            </div>
                                        </div>
                                    </div>
                                    <br>
                                    <p><img src="https://i.postimg.cc/9fMS0zgG/Screenshot.png" alt=""></p>
                                </div>
                            </li>
                            <li>
                                <div class="collapsible-header"><i class="material-icons">chevron_right</i>Настройка Личного Кабинета</div>
                                <div class="collapsible-body">
                                    <p>Во вкладке Основные нужно выбрать вашу валюту и варианты оплаты для клиентов. <br>
                                    Доступно два варианта: наличные и картой банка при получении (если у вас есть выездной терминал)</p>
                                    <p>Во вкладке Сообщения заполните Приветственное сообщение, ваши Контакты, условия и стоимость Доставки (эти сообщения будут видеть ваши клиенты из всех ботов в основном меню)</p>
                                    <p>Во вкладке TELEGRAM нужно сохранить token для добавления бота в наш сервис и нажать Создать Бот</p>
                                    <p>Во вкладке VIBER нужно сохранить token, имя, и аватар для добавления бота в наш сервис и нажать Создать Бот</p>
                                </div>
                            </li>
                            <li>
                                <div class="collapsible-header"><i class="material-icons">chevron_right</i>Создание категорий и подкатегорий</div>
                                <div class="collapsible-body">
                                    <p>Для создания категорий товаров и подкатегорий перейдите в раздел Категории и в правом нижнем углу нажмите кнопку ПЛЮС.</p>
                                    <h5><b>Создание категорий</b></h5>
                                    <p>В появившемся окне нужно ввести название категории, выбрать тип товара и сохранить.</p>
                                    <p><b>Единичный товар</b> - это товар который не имеет различных характеристик в зависимости от которых может меняться его цена (используется чаще всего).</p>
                                    <p><b>Вариативный товар</b> - это товар который имеет разные вариации, в зависимости от которых меняется его стоимость (например пицца может иметь разные размеры различной стоимости или напитки разного объема тоже могут иметь разную цену). При выборе этого типа товара, вы сможете указывать разные вариации стоимости при создании товара.</p>
                                    <br>
                                    <h5><b>Создание подкатегорий</b></h5>
                                    <p>В появившемся окне откройте вкладку подкатегории и выберите родительскую (основную) категорию к которой будет относиться создаваемая подкатегория.</p>
                                    <p><b>Важно!</b> Подкатегория может быть создана, если у основной категории нет товаров! Иначе вы не увидите ее в списке родительских категорий.</p>
                                    <p>Далее введите название подкатегории и нажмите сохранить.</p><br>
                                    <p>При удалении категории или подкатегории, автоматически удаляются все ее товары!</p>
                                </div>
                            </li>
                            <li>
                                <div class="collapsible-header"><i class="material-icons">chevron_right</i>Создание товаров</div>
                                <div class="collapsible-body">
                                    <p>Для создания товаров перейдите в основном меню в раздел Товары и в правом нижнем углу нажмите кнопку ПЛЮС.</p>
                                    <p>В появившемся окне нужно ввести название товара, выбрать категорию к которой будет относиться создаваемый товар, указать цену (ввести только цифры, валюта будет отображаться автоматически от выбранной в настройках), вставить ссылку на изображение и добавить описание.</p><br>
                                    <p>При создании вариативного товара будут доступны три поля для вариаций и цен (например, если это пицца разного размера, можно указать размер и стоимость каждого размера). Если у вашего товара только две вариации, оставьте третье поле пустым.</p><br>
                                    <p><b>Статус товара</b> - по умолчанию установлен как Активный и отображается во всех ботах всем пользователям. Если нужно скрыть от показа данный товар по каким либо причинам в ваших ботах (к примеру нет в данный момент в наличии, но ожидаются поставки) просто измените статус на Не активен и он будет скрыт от ваших пользователей.</p><br>
                                    <p><b>Ссылка на изображение</b> - можно воспользоваться этим сервисом <a href="https://postimages.org/" target="_blank">postimages.org</a> где можно разместить ваши фото и выбрать для них оптимальный размер. Не загружайте фото к товару большого размера и разрешения, это может повлиять на скорость загрузки у ваших пользователей при низкой скорости интернета. Оптимальный размер фото до 640px.</p>
                                    <p>Чтобы воспользоваться сервисом <a href="https://postimages.org/" target="_blank">postimages.org</a> перейдите по ссылке и в первом поле выберите размер (рекомендуемый 640х480), во втором поле оставьте свойство <b>Не удалять</b> и загрузите изображение. В новом окне скопируйте ссылку на изображение из поля <b>Прямая ссылка</b></p> и вставте в товар.
                                    <p><img src="https://i.postimg.cc/CLbDLWdN/Screenshot.png"></p>
                                </div>
                            </li>
                            <li>
                                <div class="collapsible-header"><i class="material-icons">chevron_right</i>Управление товарами</div>
                                <div class="collapsible-body">
                                    <p>В разделе Товары, будут отображаться все товары вашего магазина.</p>
                                    <p>Через поиск можно отфильтровать товары по категории (ввести название категории и вы увидете все товары которые к ней относятся) или найти нужный товар по его названию.</p>
                                    <p>Также можно увидеть краткое описание, цену, статус активности и кнопки управления.</p>
                                    <p>С помощью кнопок управления можно открыть, посмотреть и отредактировать каждый товар, удалить его и изменить порядковый номер отображения. В каждой категории, в ботах, товары будут отображаться в том порядке, в котором вы их создавали. Если вам необходимо изменить порядок отображения, вы можете это сделать кнопками Вверх и Вниз.</p>
                                </div>
                            </li>
                            <li>
                                <div class="collapsible-header"><i class="material-icons">chevron_right</i>Работа с заказами</div>
                                <div class="collapsible-body">
                                    <p>Чтобы посмотреть ваши заказы, выберите в меню раздел Заказы.</p>
                                    <p>Здесь вы увидите номер заказа, мессенджер с котрого вы получили заказ, имя клиента, список товаров, общую сумму и статус заказа.</p>
                                    <p>Для того, чтобы посмотреть детали заказа воспользуйтесь кнопками управления.</p>
                                    <p>Заказ можно удалить или отредактировать, если его статус неизменен на значение Обработан (к примеру тестовые, ошибочные или фейковые заказы).</p>
                                </div>
                            </li>
                            <li>
                                <div class="collapsible-header"><i class="material-icons">chevron_right</i>Работа с клиентами</div>
                                <div class="collapsible-body">
                                    <p>Чтобы посмотреть всех ваших клиентов, выберите в меню раздел Клиенты.</p>
                                    <p>Здесь вы увидете весь список ваших клиентов, мессенджер которым он пользуется, имя, телефон и дату подписки на ваши боты.</p>
                                    <p>В детальной карточке клиента можно увидеть историю заказов.</p>
                                </div>
                            </li>
                            <li>
                                <div class="collapsible-header"><i class="material-icons">chevron_right</i>Рассылка сообщений клиентам</div>
                                <div class="collapsible-body">
                                    <p>С помощью платформы easybot вы можете с целью увеличения продаж осуществлять рекламную рассылку всем своим клиентам без ограничений. Для этого выберите в меню раздел Рассылка.</p>
                                    <p>Введите название рассылки, выберите Тип сообщения - текстовое сообщение или фото с текстом.</p>
                                    <p>Также возможно отфильтровать клиентов которые уже совершали заказы или те, которые еще ничего не заказывали у вас.</p>
                                    <p>Во вкладке История рассылок будет доступна вся история по вашим рассылкам.</p>
                                </div>
                            </li>
                            <li>
                                <div class="collapsible-header"><i class="material-icons">chevron_right</i>Видеоинструкция по работе с сервисом</div>
                                <div class="collapsible-body">
                                    <h5>Подробная видеоинструкция по созданию интернет магазинов в мессенджерах с помощью платформы Easybot</h5>
                                    <video controls>
                                        <source src="video/main-info.mp4" type="video/mp4">
                                    </video>
                                </div>
                            </li>
                        </ul>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
import axios from 'axios'
export default {
    name: 'faq',
    metaInfo: {
        title: 'FAQ'
    },
    data: () => ({
        botName: '',
        link: 'Ваша пригласительная ссылка для VIBER'
    }),
    mounted() {
        setTimeout(() => {
            M.AutoInit()
        })
    },
    methods: {
      async makeViberLink() {
        const links = await axios.get(`/link/${this.botName}`)
        this.link = links.data
        console.log(links)
        M.AutoInit()
      }
    }
}
</script>
<style scoped>
.card .card-content p {
    font-size: 14px;
    margin-bottom: 10px !important;
}

h5 {
    font-size: 20px;
}

img {
    max-width: 100%;
    height: auto;
}

ul li {
    font-size: 14px;
}

video {
    max-width: 100%;
    height: auto;
}
</style>